{
    "class_name": "Sequential",
    "keras_version": "1.2.2",
    "config": [
        {
            "class_name": "Lambda",
            "config": {
                "trainable": true,
                "function": [
                    "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>B\u0000\u0000\u0000s\u0000\u0000\u0000\u0000",
                    null,
                    null
                ],
                "output_shape": null,
                "output_shape_type": "raw",
                "name": "lambda_1",
                "function_type": "lambda",
                "batch_input_shape": [
                    null,
                    66,
                    200,
                    3
                ],
                "input_dtype": "float32",
                "arguments": {}
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "nb_filter": 24,
                "trainable": true,
                "W_constraint": null,
                "nb_row": 5,
                "name": "convolution2d_1",
                "b_constraint": null,
                "border_mode": "valid",
                "bias": true,
                "dim_ordering": "tf",
                "activity_regularizer": null,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "subsample": [
                    2,
                    2
                ],
                "nb_col": 5,
                "activation": "relu"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "nb_filter": 36,
                "trainable": true,
                "W_constraint": null,
                "nb_row": 5,
                "name": "convolution2d_2",
                "b_constraint": null,
                "border_mode": "valid",
                "bias": true,
                "dim_ordering": "tf",
                "activity_regularizer": null,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "subsample": [
                    2,
                    2
                ],
                "nb_col": 5,
                "activation": "relu"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "nb_filter": 48,
                "trainable": true,
                "W_constraint": null,
                "nb_row": 5,
                "name": "convolution2d_3",
                "b_constraint": null,
                "border_mode": "valid",
                "bias": true,
                "dim_ordering": "tf",
                "activity_regularizer": null,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "subsample": [
                    2,
                    2
                ],
                "nb_col": 5,
                "activation": "relu"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "nb_filter": 64,
                "trainable": true,
                "W_constraint": null,
                "nb_row": 3,
                "name": "convolution2d_4",
                "b_constraint": null,
                "border_mode": "valid",
                "bias": true,
                "dim_ordering": "tf",
                "activity_regularizer": null,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "subsample": [
                    1,
                    1
                ],
                "nb_col": 3,
                "activation": "relu"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "nb_filter": 64,
                "trainable": true,
                "W_constraint": null,
                "nb_row": 3,
                "name": "convolution2d_5",
                "b_constraint": null,
                "border_mode": "valid",
                "bias": true,
                "dim_ordering": "tf",
                "activity_regularizer": null,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "subsample": [
                    1,
                    1
                ],
                "nb_col": 3,
                "activation": "relu"
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "name": "flatten_1",
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_1",
                "trainable": true,
                "p": 0.25
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "output_dim": 100,
                "trainable": true,
                "W_constraint": null,
                "activity_regularizer": null,
                "name": "dense_1",
                "b_constraint": null,
                "bias": true,
                "activation": "relu",
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "input_dim": 1152
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_2",
                "trainable": true,
                "p": 0.25
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "output_dim": 50,
                "trainable": true,
                "W_constraint": null,
                "activity_regularizer": null,
                "name": "dense_2",
                "b_constraint": null,
                "bias": true,
                "activation": "relu",
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "input_dim": 100
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_3",
                "trainable": true,
                "p": 0.25
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "output_dim": 10,
                "trainable": true,
                "W_constraint": null,
                "activity_regularizer": null,
                "name": "dense_3",
                "b_constraint": null,
                "bias": true,
                "activation": "relu",
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "input_dim": 50
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "output_dim": 1,
                "trainable": true,
                "W_constraint": null,
                "activity_regularizer": null,
                "name": "dense_4",
                "b_constraint": null,
                "bias": true,
                "activation": "linear",
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "input_dim": 10
            }
        }
    ]
}